app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13')  ORDER BY release_date
---
    def index
      #@movies = Movie.all
      sort = params[:sort] || session[:sort]
      case sort
      when 'title'
        ordering,@title_header = {:title => :asc}, 'hilite'
      when 'release_date'
        ordering,@date_header = {:release_date => :asc}, 'hilite'
      end
      @all_ratings = Movie.all_ratings
      @selected_ratings = params[:ratings] || session[:ratings] || {}

      if @selected_ratings == {}
        @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]